<?php

class tax {
	//------------------------------------------------------------------------------
	//受け取った数字に切り上げの税込計算する
	//------------------------------------------------------------------------------
	function taxPlusCeil($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = ceil($nom * $tax);
		return $returnValue;
	}

	//------------------------------------------------------------------------------
	// 受け取った数字に切り上げの税抜き計算する
	//------------------------------------------------------------------------------
	function taxMinusCeil($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = ceil($nom / $tax);
		return $returnValue;
	}

	//------------------------------------------------------------------------------
	//受け取った数字に切り捨ての税込計算する
	//------------------------------------------------------------------------------
	function taxPlusFloor($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = floor($nom * $tax);
		return $returnValue;
	}

	//------------------------------------------------------------------------------
	// 受け取った数字に切り捨ての税抜き計算する
	//------------------------------------------------------------------------------
	function taxMinusFloor($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = floor($nom / $tax);
		return $returnValue;
	}

	//------------------------------------------------------------------------------
	//受け取った数字に四捨五入の税込計算する
	//------------------------------------------------------------------------------
	function taxPlusRound($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = round($nom * $tax);
		return $returnValue;
	}

	//------------------------------------------------------------------------------
	// 受け取った数字に四捨五入の税抜き計算する
	//------------------------------------------------------------------------------
	function taxMinusRound($nom = null) {
		//税率を定義
		$tax = 1.08;
		$returnValue = round($nom / $tax);
		
		return $returnValue;
	}


}
?>